#+title: A quick look at the Mexican national system of researchers with Python
#+hugo_base_dir: ../..
#+hugo_section: post
#+author: Rodrigo Dorantes-Gilardi
#+date: <2019-09-28 Sat>
#+email: rodgdor@gmail.com
* Basic Overview
	If we go to [[https://www.conacyt.gob.mx/index.php/el-conacyt/sistema-nacional-de-investigadores/archivo-historico][this link]], we can see the records of the actual researchers that are members in the
	SNI as of 2018. I've downloaded this excel file in my =Downloads= folder and read it using pandas.
	

#+begin_src python :results output
import pandas as pd

df_all = pd.read_excel('/Users/rdora/Downloads/BENEFICIARIOS_2018.xlsx')
# Just take the first 14 columns
df_all = df.iloc[:, 0:14]
print(df.shape)
#+end_src

#+RESULTS:
: (28633, 14)

According to this, there are 28,633 SNI researchers. We'll keep this table for later.
